jimmywong2003/nrf5-ancs-ams-wristband-example/ble_app_ancs_c_ams_c/main.c
        err_code = nrf_drv_saadc_buffer_convert(&adc_buf[0], 1);
        APP_ERROR_CHECK(err_code);

        err_code = nrf_drv_saadc_buffer_convert(&adc_buf[1], 1);
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *          This function will start the ADC.
 *
 * @param[in] p_context   Pointer used for passing some arbitrary information (context) from the
 *                        app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
        UNUSED_PARAMETER(p_context);
        adc_configure();

        ret_code_t err_code;
        err_code = nrf_drv_saadc_sample();
        APP_ERROR_CHECK(err_code);
}

/**@brief   Function for handling app_uart events.
 *
 * @details This function will receive a single character from the app_uart module and append it to
 *          a string. The string will be be sent over BLE when the last character received was a
 *          'new line' '\n' (hex 0x0A) or if the string has reached the maximum data length.
 */
/**@snippet [Handling the data received over UART] */
void uart_event_handle(app_uart_evt_t *p_event)
{
        static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
        static uint8_t index = 0;
        uint32_t err_code;

        switch (p_event->evt_type)
        {
        case APP_UART_DATA_READY:
                UNUSED_VARIABLE(app_uart_get(&data_array[index]));
                index++;

                if ((data_array[index - 1] == '\n') ||
                    (data_array[index - 1] == '\r') ||
                    (index >= m_ble_nus_max_data_len))
                {
                        if (index > 1)
                        {
                                NRF_LOG_DEBUG("Ready to send data over BLE NUS");
                                NRF_LOG_HEXDUMP_DEBUG(data_array, index);
                                do
                                {
                                        uint16_t length = (uint16_t)index;
                                        err_code = ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);
                                        if ((err_code != NRF_ERROR_INVALID_STATE) &&
                                            (err_code != NRF_ERROR_RESOURCES) &&
                                            (err_code != NRF_ERROR_NOT_FOUND))
                                        {
                                                APP_ERROR_CHECK(err_code);
                                        }
                                } while (err_code == NRF_ERROR_RESOURCES);
                        }
                }
                break;

        case APP_UART_COMMUNICATION_ERROR:
                APP_ERROR_HANDLER(p_event->data.error_communication);
                break;

        case APP_UART_FIFO_ERROR:
                APP_ERROR_HANDLER(p_event->data.error_code);
                break;

        default:
                break;
        }
}

/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
        uint32_t err_code;
        app_uart_comm_params_t const comm_params =
        {
                .rx_pin_no = RX_PIN_NUMBER,
                .tx_pin_no = TX_PIN_NUMBER,
                .rts_pin_no = RTS_PIN_NUMBER,
                .cts_pin_no = CTS_PIN_NUMBER,
                .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
                .use_parity = false,
#if defined(UART_PRESENT)
                .baud_rate = NRF_UART_BAUDRATE_115200
#else
                .baud_rate = NRF_UARTE_BAUDRATE_115200
#endif
        };

        APP_UART_FIFO_INIT(&comm_params,
                           UART_RX_BUF_SIZE,
                           UART_TX_BUF_SIZE,
                           uart_event_handle,
                           APP_IRQ_PRIORITY_LOWEST,
                           err_code);
        APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting advertising. */
static void advertising_start(bool erase_bonds)
{
        if (erase_bonds == true)
        {
                delete_bonds();
                // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
        }
        else
        {
                ret_code_t ret;

                memset(m_whitelist_peers, PM_PEER_ID_INVALID, sizeof(m_whitelist_peers));
                m_whitelist_peer_cnt = (sizeof(m_whitelist_peers) / sizeof(pm_peer_id_t));

                peer_list_get(m_whitelist_peers, &m_whitelist_peer_cnt);

                ret = pm_whitelist_set(m_whitelist_peers, m_whitelist_peer_cnt);
                APP_ERROR_CHECK(ret);

                // Setup the device identies list.
                // Some SoftDevices do not support this feature.
                ret = pm_device_identities_list_set(m_whitelist_peers, m_whitelist_peer_cnt);
                if (ret != NRF_ERROR_NOT_SUPPORTED)
                {
                        APP_ERROR_CHECK(ret);
                }

                ret = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
                APP_ERROR_CHECK(ret);
        }
}

/**@brief Function for handling Peer Manager events.
 *
 * @param[in] p_evt  Peer Manager event.
 */
static void pm_evt_handler(pm_evt_t const * p_evt)
{
        ret_code_t ret;

        pm_handler_on_pm_evt(p_evt);
        pm_handler_flash_clean(p_evt);

        switch (p_evt->evt_id)
        {
        case PM_EVT_BONDED_PEER_CONNECTED:
        {
                if (p_evt->peer_id != PM_PEER_ID_INVALID)
                {
                        uint16_t data_len = sizeof(m_peer_srv_buf);
                        ret = pm_peer_data_remote_db_load(p_evt->peer_id, m_peer_srv_buf, &data_len);
                        if (ret == NRF_ERROR_NOT_FOUND)
                        {
                                NRF_LOG_DEBUG("Could not find the remote database in flash.");
                                ret = nrf_ble_gatts_c_handles_assign(&m_gatts_c, p_evt->conn_handle, NULL);
                                APP_ERROR_CHECK(ret);

                                // Discover peer's services.
                                m_ancs_discovered  = false;
                                m_gatts_discovered = false;
                                memset(&m_db_disc, 0x00, sizeof(m_db_disc));
                                ret = ble_db_discovery_start(&m_db_disc, p_evt->conn_handle);
                                APP_ERROR_CHECK(ret);
                        }
                        else
                        {
                                // Check if the load was successful.
                                ASSERT(data_len == sizeof(m_peer_srv_buf));
                                APP_ERROR_CHECK(ret);
                                NRF_LOG_INFO("Remote Database loaded from flash.");

                                // Assign the loaded handles to the GATT Service client module.
                                ble_gatt_db_char_t srv_changed_handles = m_peer_srv_buf[0].charateristics[0];
                                ret = nrf_ble_gatts_c_handles_assign(&m_gatts_c,
                                                                     p_evt->conn_handle,
                                                                     &srv_changed_handles);
                                APP_ERROR_CHECK(ret);

                                // Enable indications.
                                ret = nrf_ble_gatts_c_enable_indication(&m_gatts_c, true);
                                APP_ERROR_CHECK(ret);

                                //Load the relevant handles into a ble_ancs_c_service_t struct that can be
                                // assigned to the ANCS module.
                                ble_ancs_c_service_t ancs_handles;
                                ble_gatt_db_char_t * p_char           = m_peer_srv_buf[1].charateristics;
                                ancs_handles.control_point_char       = p_char[0].characteristic;
                                ancs_handles.notif_source_char        = p_char[1].characteristic;
                                ancs_handles.notif_source_cccd.handle = p_char[1].cccd_handle;
                                ancs_handles.data_source_char         = p_char[2].characteristic;
                                ancs_handles.data_source_cccd.handle  = p_char[2].cccd_handle;

