jimmywong2003/nrf5-ancs-ams-wristband-example/ble_app_ancs_c_ams_c/main.c
                                ret = nrf_ble_ancs_c_handles_assign(&m_ancs_c, p_evt->conn_handle,
                                                                    &ancs_handles);
                                APP_ERROR_CHECK(ret);
                        }
                }
        } break;

        case PM_EVT_CONN_SEC_SUCCEEDED:
        {
                // Check it the Service Changed characteristic handle exists in our client instance.
                // If it is invalid, we know service discovery is needed.
                // (No database was loaded during @ref PM_EVT_BONDED_PEER_CONNECTED)
                if (m_gatts_c.srv_changed_char.characteristic.handle_value == BLE_GATT_HANDLE_INVALID)
                {
                        ret = nrf_ble_gatts_c_handles_assign(&m_gatts_c, p_evt->conn_handle, NULL);
                        APP_ERROR_CHECK(ret);

                        // Discover peer's services.
                        m_ancs_discovered  = false;
                        m_gatts_discovered = false;
                        memset(&m_db_disc, 0x00, sizeof(m_db_disc));
                        ret = ble_db_discovery_start(&m_db_disc, p_evt->conn_handle);
                        APP_ERROR_CHECK(ret);
                }

        } break;

        case PM_EVT_PEERS_DELETE_SUCCEEDED:
        {
                advertising_start(false);
        } break;

        case PM_EVT_PEER_DATA_UPDATE_SUCCEEDED:
        {
                // Note: You should check on what kind of white list policy your application should use.
                if (     p_evt->params.peer_data_update_succeeded.flash_changed
                         && (p_evt->params.peer_data_update_succeeded.data_id == PM_PEER_DATA_ID_BONDING))
                {
                        NRF_LOG_DEBUG("New Bond, add the peer to the whitelist if possible");
                        NRF_LOG_DEBUG("\tm_whitelist_peer_cnt %d, MAX_PEERS_WLIST %d",
                                      m_whitelist_peer_cnt + 1,
                                      BLE_GAP_WHITELIST_ADDR_MAX_COUNT);

                        if (m_whitelist_peer_cnt < BLE_GAP_WHITELIST_ADDR_MAX_COUNT)
                        {
                                // Bonded to a new peer, add it to the whitelist.
                                m_whitelist_peers[m_whitelist_peer_cnt++] = p_evt->peer_id;

                                // The whitelist has been modified, update it in the Peer Manager.
                                ret = pm_device_identities_list_set(m_whitelist_peers, m_whitelist_peer_cnt);
                                if (ret != NRF_ERROR_NOT_SUPPORTED)
                                {
                                        APP_ERROR_CHECK(ret);
                                }

                                ret = pm_whitelist_set(m_whitelist_peers, m_whitelist_peer_cnt);
                                APP_ERROR_CHECK(ret);
                        }
                }
        } break;

        default:
                break;
        }
}


/**@brief Function for setting up GATTC notifications from the Notification Provider.
 *
 * @details This function is called when a successful connection has been established.
 */
static void apple_notification_setup(void)
{
        ret_code_t ret;

        nrf_delay_ms(100); // Delay because we cannot add a CCCD to close to starting encryption. iOS specific.

        ret = ble_ancs_c_notif_source_notif_enable(&m_ancs_c);
        APP_ERROR_CHECK(ret);

        ret = ble_ancs_c_data_source_notif_enable(&m_ancs_c);
        APP_ERROR_CHECK(ret);

        NRF_LOG_DEBUG("Notifications Enabled.");
}


/**@brief Function for printing an iOS notification.
 *
 * @param[in] p_notif  Pointer to the iOS notification.
 */
static void notif_print(ble_ancs_c_evt_notif_t * p_notif)
{
        NRF_LOG_INFO("\r\nNotification");
        NRF_LOG_INFO("Event:       %s", (uint32_t)lit_eventid[p_notif->evt_id]);
        NRF_LOG_INFO("Category ID: %s", (uint32_t)lit_catid[p_notif->category_id]);
        NRF_LOG_INFO("Category Cnt:%u", (unsigned int) p_notif->category_count);
        NRF_LOG_INFO("UID:         %u", (unsigned int) p_notif->notif_uid);

        NRF_LOG_INFO("Flags:");
        if (p_notif->evt_flags.silent == 1)
        {
                NRF_LOG_INFO(" Silent");
        }
        if (p_notif->evt_flags.important == 1)
        {
                NRF_LOG_INFO(" Important");
        }
        if (p_notif->evt_flags.pre_existing == 1)
        {
                NRF_LOG_INFO(" Pre-existing");
        }
        if (p_notif->evt_flags.positive_action == 1)
        {
                NRF_LOG_INFO(" Positive Action");
        }
        if (p_notif->evt_flags.negative_action == 1)
        {
                NRF_LOG_INFO(" Negative Action");
        }
}


/**@brief Function for printing iOS notification attribute data.
 *
 * @param[in] p_attr Pointer to an iOS notification attribute.
 */
static void notif_attr_print(ble_ancs_c_attr_t * p_attr)
{
        if (p_attr->attr_len != 0)
        {
                NRF_LOG_INFO("%s: %s", (uint32_t)lit_attrid[p_attr->attr_id],
                             nrf_log_push((char *)p_attr->p_attr_data));
        }
        else if (p_attr->attr_len == 0)
        {
                NRF_LOG_INFO("%s: (N/A)", (uint32_t)lit_attrid[p_attr->attr_id]);
        }
}


/**@brief Function for printing iOS notification attribute data.
 *
 * @param[in] p_attr Pointer to an iOS App attribute.
 */
static void app_attr_print(ble_ancs_c_attr_t * p_attr)
{
        if (p_attr->attr_len != 0)
        {
                NRF_LOG_INFO("%s: %s", (uint32_t)lit_appid[p_attr->attr_id], (uint32_t)p_attr->p_attr_data);
        }
        else if (p_attr->attr_len == 0)
        {
                NRF_LOG_INFO("%s: (N/A)", (uint32_t) lit_appid[p_attr->attr_id]);
        }
}


/**@brief Function for printing out errors that originated from the Notification Provider (iOS).
 *
 * @param[in] err_code_np Error code received from NP.
 */
static void err_code_print(uint16_t err_code_np)
{
        switch (err_code_np)
        {
        case BLE_ANCS_NP_UNKNOWN_COMMAND:
                NRF_LOG_INFO("Error: Command ID was not recognized by the Notification Provider. ");
                break;

        case BLE_ANCS_NP_INVALID_COMMAND:
                NRF_LOG_INFO("Error: Command failed to be parsed on the Notification Provider. ");
                break;

        case BLE_ANCS_NP_INVALID_PARAMETER:
                NRF_LOG_INFO("Error: Parameter does not refer to an existing object on the Notification Provider. ");
                break;

        case BLE_ANCS_NP_ACTION_FAILED:
                NRF_LOG_INFO("Error: Perform Notification Action Failed on the Notification Provider. ");
                break;

        default:
                break;
        }
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
        ret_code_t ret;

        ret = app_timer_init();
        APP_ERROR_CHECK(ret);

        // Create battery timer.
        ret = app_timer_create(&m_battery_timer_id,
                                    APP_TIMER_MODE_REPEATED,
                                    battery_level_meas_timeout_handler);
        APP_ERROR_CHECK(ret);
}

static void timers_start(void)
{
        ret_code_t ret;
        // Create battery timer.
        ret = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL, NULL);
        APP_ERROR_CHECK(ret);
}


/**@brief Function for handling events from the GATT Servive client module.

   @param[in] p_evt GATT Service event.
 */
static void gatts_c_evt_handler(nrf_ble_gatts_c_evt_t * p_evt)
{
        ret_code_t ret = NRF_SUCCESS;

        switch (p_evt->evt_type)
        {
        case NRF_BLE_GATTS_C_EVT_DISCOVERY_COMPLETE:
        {
                NRF_LOG_DEBUG("GATT Service and Service Changed characteristic found on server.");

                ret = nrf_ble_gatts_c_handles_assign(&m_gatts_c,
                                                     p_evt->conn_handle,
                                                     &p_evt->params.srv_changed_char);
                APP_ERROR_CHECK(ret);

                pm_peer_id_t peer_id;
                ret = pm_peer_id_get(p_evt->conn_handle, &peer_id);
                APP_ERROR_CHECK(ret);

                memset(&m_peer_srv_buf[0], 0, sizeof(m_peer_srv_buf[0]));
                m_peer_srv_buf[0].charateristics[0] = p_evt->params.srv_changed_char;

                m_gatts_discovered = true;
                if(m_gatts_discovered && m_ancs_discovered)
                {
                        ret = pm_peer_data_remote_db_store(peer_id,
                                                           (ble_gatt_db_srv_t *)m_peer_srv_buf,
                                                           sizeof(m_peer_srv_buf),
                                                           NULL);
                        if (ret == NRF_ERROR_STORAGE_FULL)
                        {
                                ret = fds_gc();
                        }
                        APP_ERROR_CHECK(ret);
                }
                ret = nrf_ble_gatts_c_enable_indication(&m_gatts_c, true);
                APP_ERROR_CHECK(ret);
        } break;

        case NRF_BLE_GATTS_C_EVT_DISCOVERY_FAILED:
                NRF_LOG_DEBUG("GATT Service or Service Changed characteristic not found on server.");
                break;

