jimmywong2003/nrf5-ancs-ams-wristband-example/ble_app_ancs_c_ams_c/main.c
        case NRF_BLE_GATTS_C_EVT_DISCONN_COMPLETE:
                NRF_LOG_DEBUG("GATTS Service client disconnected connection handle %i.",
                              p_evt->conn_handle);
                break;

        case NRF_BLE_GATTS_C_EVT_SRV_CHANGED:
                NRF_LOG_DEBUG("Service Changed indication received.");

                // Discover peer's services.
                m_ancs_discovered  = false;
                m_gatts_discovered = false;
                ret = ble_db_discovery_start(&m_db_disc, p_evt->conn_handle);
                APP_ERROR_CHECK(ret);
                break;

        default:
                break;
        }
}


/**@brief Function for handling the Apple Notification Service client.
 *
 * @details This function is called for all events in the Apple Notification client that
 *          are passed to the application.
 *
 * @param[in] p_evt  Event received from the Apple Notification Service client.
 */
static void ancs_c_evt_handler(ble_ancs_c_evt_t * p_evt)
{

        switch (p_evt->evt_type)
        {
        case BLE_ANCS_C_EVT_DISCOVERY_COMPLETE:
        {
                ret_code_t ret = NRF_SUCCESS;
                NRF_LOG_DEBUG("Apple Notification Center Service discovered on the server.");
                ret = nrf_ble_ancs_c_handles_assign(&m_ancs_c, p_evt->conn_handle, &p_evt->service);
                APP_ERROR_CHECK(ret);

                pm_peer_id_t peer_id;
                ret = pm_peer_id_get(p_evt->conn_handle, &peer_id);
                APP_ERROR_CHECK(ret);

                // Copy the needed ANCS handles into a ble_gatt_db_srv_t struct that will be stored in
                // flash.
                ble_gatt_db_char_t * p_char = m_peer_srv_buf[1].charateristics;
                memset(&m_peer_srv_buf[1], 0, sizeof(m_peer_srv_buf[1]));

                p_char[0].characteristic = p_evt->service.control_point_char;
                p_char[1].characteristic = p_evt->service.notif_source_char;
                p_char[1].cccd_handle    = p_evt->service.notif_source_cccd.handle;
                p_char[2].characteristic = p_evt->service.data_source_char;
                p_char[2].cccd_handle    = p_evt->service.data_source_cccd.handle;

                m_ancs_discovered = true;

                if (m_gatts_discovered && m_ancs_discovered)
                {
                        ret = pm_peer_data_remote_db_store(peer_id,
                                                           (ble_gatt_db_srv_t *)m_peer_srv_buf,
                                                           sizeof(m_peer_srv_buf),
                                                           NULL);
                        if (ret == NRF_ERROR_STORAGE_FULL)
                        {
                                ret = fds_gc();
                        }
                        APP_ERROR_CHECK(ret);
                }
                apple_notification_setup();
        } break;

        case BLE_ANCS_C_EVT_NOTIF:
                m_notification_latest = p_evt->notif;
                notif_print(&m_notification_latest);
                break;

        case BLE_ANCS_C_EVT_NOTIF_ATTRIBUTE:
                m_notif_attr_latest = p_evt->attr;
                notif_attr_print(&m_notif_attr_latest);
                if (p_evt->attr.attr_id == BLE_ANCS_NOTIF_ATTR_ID_APP_IDENTIFIER)
                {
                        m_notif_attr_app_id_latest = p_evt->attr;
                }
                break;
        case BLE_ANCS_C_EVT_DISCOVERY_FAILED:
                NRF_LOG_DEBUG("Apple Notification Center Service not discovered on the server.");
                break;

        case BLE_ANCS_C_EVT_APP_ATTRIBUTE:
                app_attr_print(&p_evt->attr);
                break;
        case BLE_ANCS_C_EVT_NP_ERROR:
                err_code_print(p_evt->err_code_np);
                break;
        default:
                // No implementation needed.
                break;
        }
}


/**@brief Function for initializing GAP connection parameters.
 *
 * @details Use this function to set up all necessary GAP (Generic Access Profile)
 *          parameters of the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
        ret_code_t ret;
        ble_gap_conn_params_t gap_conn_params;
        ble_gap_conn_sec_mode_t sec_mode;

        BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

        ret = sd_ble_gap_device_name_set(&sec_mode, (const uint8_t *)DEVICE_NAME, strlen(DEVICE_NAME));
        APP_ERROR_CHECK(ret);

        memset(&gap_conn_params, 0, sizeof(gap_conn_params));

        gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
        gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
        gap_conn_params.slave_latency     = SLAVE_LATENCY;
        gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

        ret = sd_ble_gap_ppcp_set(&gap_conn_params);
        APP_ERROR_CHECK(ret);
}

/**@brief Function for handling events from the GATT library. */
void gatt_evt_handler(nrf_ble_gatt_t *p_gatt, nrf_ble_gatt_evt_t const *p_evt)
{
        uint32_t data_length;
        if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED))
        {
                data_length = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
                //m_ble_params_info.mtu = m_ble_its_max_data_len;
                m_ble_nus_max_data_len = data_length;
                NRF_LOG_INFO("gatt_event: ATT MTU is set to 0x%X (%d)", data_length, data_length);
        }
        else if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_DATA_LENGTH_UPDATED))
        {
                data_length = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH - 4;
                NRF_LOG_INFO("gatt_event: Data len is set to 0x%X (%d)", data_length, data_length);
                m_ble_nus_max_data_len = data_length;
        }
        NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x",
                      p_gatt->att_mtu_desired_central,
                      p_gatt->att_mtu_desired_periph);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
        ret_code_t ret = nrf_ble_gatt_init(&m_gatt, NULL);
        APP_ERROR_CHECK(ret);

        ret = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
        APP_ERROR_CHECK(ret);

        ret = nrf_ble_gatt_data_length_set(&m_gatt, BLE_CONN_HANDLE_INVALID, NRF_SDH_BLE_GAP_DATA_LENGTH);
        APP_ERROR_CHECK(ret);
}


/**@brief Function for handling the Apple Notification Service client errors.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void apple_notification_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
        ret_code_t ret;
        ble_conn_params_init_t cp_init;

        memset(&cp_init, 0, sizeof(cp_init));

        cp_init.p_conn_params                  = NULL;
        cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
        cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
        cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
        cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
        cp_init.disconnect_on_fail             = true;
        cp_init.evt_handler                    = NULL;
        cp_init.error_handler                  = conn_params_error_handler;

        ret = ble_conn_params_init(&cp_init);
        APP_ERROR_CHECK(ret);
}


/**@brief Function for handling Database Discovery events.
 *
 * @details This function is a callback function to handle events from the database discovery
 *          module. Depending on the UUIDs that are discovered, this function should forward the
 *          events to their respective service instances.
 *
 * @param[in] p_event  Pointer to the database discovery event.
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
        ble_ancs_c_on_db_disc_evt(&m_ancs_c, p_evt);
        nrf_ble_gatts_c_on_db_disc_evt(&m_gatts_c, p_evt);
}


/**@brief Function for the Peer Manager initialization.
 */
static void peer_manager_init(void)
{
        ble_gap_sec_params_t sec_param;
        ret_code_t ret;

