jimmywong2003/nrf5-ancs-ams-wristband-example/ble_app_ancs_c_ams_c/main.c
        ret = pm_init();
        APP_ERROR_CHECK(ret);

        memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

        // Security parameters to be used for all security procedures.
        sec_param.bond           = SEC_PARAM_BOND;
        sec_param.mitm           = SEC_PARAM_MITM;
        sec_param.lesc           = SEC_PARAM_LESC;
        sec_param.keypress       = SEC_PARAM_KEYPRESS;
        sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
        sec_param.oob            = SEC_PARAM_OOB;
        sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
        sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
        sec_param.kdist_own.enc  = 1;
        sec_param.kdist_own.id   = 1;
        sec_param.kdist_peer.enc = 1;
        sec_param.kdist_peer.id  = 1;

        ret = pm_sec_params_set(&sec_param);
        APP_ERROR_CHECK(ret);

        ret = pm_register(pm_evt_handler);
        APP_ERROR_CHECK(ret);
}


/**
 * @brief Delete all data stored for all peers.
 */
static void delete_bonds(void)
{
        ret_code_t err_code;

        NRF_LOG_INFO("Erase bonds!");

        err_code = pm_peers_delete();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for putting the chip into sleep mode.
 *
 * @note This function will not return.
 */
static void sleep_mode_enter(void)
{
        uint32_t ret = bsp_indication_set(BSP_INDICATE_IDLE);
        APP_ERROR_CHECK(ret);

        // Prepare wakeup buttons.
        ret = bsp_btn_ble_sleep_mode_prepare();
        APP_ERROR_CHECK(ret);

        // Go to system-off mode (this function will not return; wakeup will cause a reset).
        ret = sd_power_system_off();
        APP_ERROR_CHECK(ret);
}


/**@brief Function for handling advertising events.
 *
 * @details This function is called for advertising events that are passed to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
        ret_code_t ret;

        switch (ble_adv_evt)
        {
        case BLE_ADV_EVT_FAST:
                NRF_LOG_INFO("Fast advertising");
                ret = bsp_indication_set(BSP_INDICATE_ADVERTISING);
                APP_ERROR_CHECK(ret);
                break;

        case BLE_ADV_EVT_SLOW:
                NRF_LOG_INFO("Slow advertising");
                ret = bsp_indication_set(BSP_INDICATE_ADVERTISING_SLOW);
                APP_ERROR_CHECK(ret);
                break;

        case BLE_ADV_EVT_FAST_WHITELIST:
                NRF_LOG_INFO("Fast advertising with Whitelist");
                ret = bsp_indication_set(BSP_INDICATE_ADVERTISING_WHITELIST);
                APP_ERROR_CHECK(ret);
                break;

        case BLE_ADV_EVT_IDLE:
                sleep_mode_enter();
                break;

        case BLE_ADV_EVT_WHITELIST_REQUEST:
        {
                ble_gap_addr_t whitelist_addrs[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
                ble_gap_irk_t whitelist_irks[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
                uint32_t addr_cnt = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;
                uint32_t irk_cnt  = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

                ret = pm_whitelist_get(whitelist_addrs, &addr_cnt, whitelist_irks, &irk_cnt);
                APP_ERROR_CHECK(ret);
                NRF_LOG_DEBUG("pm_whitelist_get returns %d addr in whitelist and %d irk whitelist",
                              addr_cnt,
                              irk_cnt);

                // Apply the whitelist.
                ret = ble_advertising_whitelist_reply(&m_advertising,
                                                      whitelist_addrs,
                                                      addr_cnt,
                                                      whitelist_irks,
                                                      irk_cnt);
                APP_ERROR_CHECK(ret);
        }
        break;

        default:
                break;
        }
}


/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
        ret_code_t ret = NRF_SUCCESS;

        pm_handler_secure_on_connection(p_ble_evt);
        ble_gap_evt_t const * p_gap_evt = &p_ble_evt->evt.gap_evt;

        switch (p_ble_evt->header.evt_id)
        {
        case BLE_GAP_EVT_CONNECTED:
                NRF_LOG_INFO("Connected.");
                ret = bsp_indication_set(BSP_INDICATE_CONNECTED);
                APP_ERROR_CHECK(ret);

                m_cur_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
                m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;

                ret = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_cur_conn_handle);
                APP_ERROR_CHECK(ret);
                break;

        case BLE_GAP_EVT_DISCONNECTED:
                NRF_LOG_INFO("Disconnected.");
                m_cur_conn_handle = BLE_CONN_HANDLE_INVALID;
                m_conn_handle = BLE_CONN_HANDLE_INVALID;
                NRF_LOG_INFO("Disconnected, handle: %d, reason: 0x%x",
                             p_gap_evt->conn_handle,
                             p_gap_evt->params.disconnected.reason);

                if (p_ble_evt->evt.gap_evt.conn_handle == m_ancs_c.conn_handle)
                {
                        m_ancs_c.conn_handle = BLE_CONN_HANDLE_INVALID;
                }
                break; // BLE_GAP_EVT_DISCONNECTED

        case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
        {
                NRF_LOG_DEBUG("PHY update request.");
                ble_gap_phys_t const phys =
                {
                        .rx_phys = BLE_GAP_PHY_AUTO,
                        .tx_phys = BLE_GAP_PHY_AUTO,
                };
                ret = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
                APP_ERROR_CHECK(ret);
        } break;

        case BLE_GATTC_EVT_TIMEOUT:
                // Disconnect on GATT Client timeout event.
                NRF_LOG_DEBUG("GATT Client Timeout.");
                ret = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                            BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(ret);
                break;

        case BLE_GATTS_EVT_TIMEOUT:
                // Disconnect on GATT Server timeout event.
                NRF_LOG_DEBUG("GATT Server Timeout.");
                ret = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                            BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                APP_ERROR_CHECK(ret);
                break;

        default:
                // No implementation needed.
                break;
        }
}


/**@brief Function for handling events from the BSP module.
 *
 * @param[in] event  Event generated by button press.
 */
static void bsp_event_handler(bsp_event_t event)
{
        ret_code_t ret;

