jimmywong2003/nrf5-ancs-ams-wristband-example/ble_app_ancs_c_ams_c/main.c
        switch (event)
        {
        case BSP_EVENT_SLEEP:
                sleep_mode_enter();
                break;

        case BSP_EVENT_DISCONNECT:
                ret = sd_ble_gap_disconnect(m_cur_conn_handle,
                                            BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
                if (ret != NRF_ERROR_INVALID_STATE)
                {
                        APP_ERROR_CHECK(ret);
                }
                break;

        case BSP_EVENT_WHITELIST_OFF:
                if (m_ancs_c.conn_handle == BLE_CONN_HANDLE_INVALID)
                {
                        ret = ble_advertising_restart_without_whitelist(&m_advertising);
                        if (ret != NRF_ERROR_INVALID_STATE)
                        {
                                APP_ERROR_CHECK(ret);
                        }
                }
                break;

        case BSP_EVENT_KEY_0:
                ret = nrf_ble_ancs_c_request_attrs(&m_ancs_c, &m_notification_latest);
                APP_ERROR_CHECK(ret);
                break;

        case BSP_EVENT_KEY_1:
                if (m_notif_attr_app_id_latest.attr_id == BLE_ANCS_NOTIF_ATTR_ID_APP_IDENTIFIER
                    && m_notif_attr_app_id_latest.attr_len != 0)
                {
                        NRF_LOG_INFO("Request for %s: ", (uint32_t)m_notif_attr_app_id_latest.p_attr_data);
                        ret = nrf_ble_ancs_c_app_attr_request(&m_ancs_c,
                                                              m_notif_attr_app_id_latest.p_attr_data,
                                                              m_notif_attr_app_id_latest.attr_len);
                        APP_ERROR_CHECK(ret);
                }
                break;

        case BSP_EVENT_KEY_2:
                if (m_notification_latest.evt_flags.positive_action == true)
                {
                        NRF_LOG_INFO("Performing Positive Action.");
                        ret = nrf_ancs_perform_notif_action(&m_ancs_c,
                                                            m_notification_latest.notif_uid,
                                                            ACTION_ID_POSITIVE);
                        APP_ERROR_CHECK(ret);
                }
                break;

        case BSP_EVENT_KEY_3:
                if (m_notification_latest.evt_flags.negative_action == true)
                {
                        NRF_LOG_INFO("Performing Negative Action.");
                        ret = nrf_ancs_perform_notif_action(&m_ancs_c,
                                                            m_notification_latest.notif_uid,
                                                            ACTION_ID_NEGATIVE);
                        APP_ERROR_CHECK(ret);
                }
                break;

        default:
                break;
        }
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
        ret_code_t err_code;

        err_code = nrf_sdh_enable_request();
        APP_ERROR_CHECK(err_code);

        // Configure the BLE stack using the default settings.
        // Fetch the start address of the application RAM.
        uint32_t ram_start = 0;
        err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
        APP_ERROR_CHECK(err_code);

        // Enable BLE stack.
        err_code = nrf_sdh_ble_enable(&ram_start);
        APP_ERROR_CHECK(err_code);

        err_code = sd_power_mode_set(NRF_POWER_MODE_LOWPWR);
        APP_ERROR_CHECK(err_code);

        err_code = sd_power_dcdc_mode_set(NRF_POWER_DCDC_ENABLE);
        APP_ERROR_CHECK(err_code);

        // Register a handler for BLE events.
        NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
        APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t *p_evt)
{
        if (p_evt->type == BLE_NUS_EVT_RX_DATA)
        {
                uint32_t err_code;

                for (uint32_t i = 0; i < p_evt->params.rx_data.length; i++)
                {
                        do
                        {
                                err_code = app_uart_put(p_evt->params.rx_data.p_data[i]);
                                if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                                {
                                        NRF_LOG_ERROR("Failed receiving NUS message. Error 0x%x. ", err_code);
                                        APP_ERROR_CHECK(err_code);
                                }
                        } while (err_code == NRF_ERROR_BUSY);
                }
                if (p_evt->params.rx_data.p_data[p_evt->params.rx_data.length - 1] == '\r')
                {
                        while (app_uart_put('\n') == NRF_ERROR_BUSY);
                }
        }
        else if (p_evt->type == BLE_NUS_EVT_COMM_STARTED)
        {
                NRF_LOG_INFO("NUS : BLE_NUS_EVT_COMM_STARTED");
        }
        else if (p_evt->type == BLE_NUS_EVT_COMM_STOPPED)
        {
                NRF_LOG_INFO("NUS : BLE_NUS_EVT_COMM_STOPPED");
        }
}
/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
        ret_code_t ret;
        ble_ancs_c_init_t ancs_c_init;
        ble_nus_init_t nus_init;
        nrf_ble_gatts_c_init_t gatts_c_init;
        nrf_ble_qwr_init_t qwr_init = {0};

