jimmywong2003/nrf5-ancs-ams-wristband-example/ble_app_ancs_c_ams_c/main.c
        // Initialize Queued Write Module.
        qwr_init.error_handler = nrf_qwr_error_handler;

        ret = nrf_ble_qwr_init(&m_qwr, &qwr_init);
        APP_ERROR_CHECK(ret);

        // Init the GATTS client module.
        memset(&gatts_c_init, 0, sizeof(gatts_c_init));

        gatts_c_init.evt_handler = gatts_c_evt_handler;

        ret = nrf_ble_gatts_c_init(&m_gatts_c, &gatts_c_init);
        APP_ERROR_CHECK(ret);

        // Init the Apple Notification Center Service client module.
        memset(&ancs_c_init, 0, sizeof(ancs_c_init));

        ret = nrf_ble_ancs_c_attr_add(&m_ancs_c,
                                      BLE_ANCS_NOTIF_ATTR_ID_APP_IDENTIFIER,
                                      m_attr_appid,
                                      ATTR_DATA_SIZE);
        APP_ERROR_CHECK(ret);

        ret = nrf_ble_ancs_c_app_attr_add(&m_ancs_c,
                                          BLE_ANCS_APP_ATTR_ID_DISPLAY_NAME,
                                          m_attr_disp_name,
                                          sizeof(m_attr_disp_name));
        APP_ERROR_CHECK(ret);

        ret = nrf_ble_ancs_c_attr_add(&m_ancs_c,
                                      BLE_ANCS_NOTIF_ATTR_ID_TITLE,
                                      m_attr_title,
                                      ATTR_DATA_SIZE);
        APP_ERROR_CHECK(ret);

        ret = nrf_ble_ancs_c_attr_add(&m_ancs_c,
                                      BLE_ANCS_NOTIF_ATTR_ID_MESSAGE,
                                      m_attr_message,
                                      ATTR_DATA_SIZE);
        APP_ERROR_CHECK(ret);

        ret = nrf_ble_ancs_c_attr_add(&m_ancs_c,
                                      BLE_ANCS_NOTIF_ATTR_ID_SUBTITLE,
                                      m_attr_subtitle,
                                      ATTR_DATA_SIZE);
        APP_ERROR_CHECK(ret);

        ret = nrf_ble_ancs_c_attr_add(&m_ancs_c,
                                      BLE_ANCS_NOTIF_ATTR_ID_MESSAGE_SIZE,
                                      m_attr_message_size,
                                      ATTR_DATA_SIZE);
        APP_ERROR_CHECK(ret);

        ret = nrf_ble_ancs_c_attr_add(&m_ancs_c,
                                      BLE_ANCS_NOTIF_ATTR_ID_DATE,
                                      m_attr_date,
                                      ATTR_DATA_SIZE);
        APP_ERROR_CHECK(ret);

        ret = nrf_ble_ancs_c_attr_add(&m_ancs_c,
                                      BLE_ANCS_NOTIF_ATTR_ID_POSITIVE_ACTION_LABEL,
                                      m_attr_posaction,
                                      ATTR_DATA_SIZE);
        APP_ERROR_CHECK(ret);

        ret = nrf_ble_ancs_c_attr_add(&m_ancs_c,
                                      BLE_ANCS_NOTIF_ATTR_ID_NEGATIVE_ACTION_LABEL,
                                      m_attr_negaction,
                                      ATTR_DATA_SIZE);
        APP_ERROR_CHECK(ret);

        ancs_c_init.evt_handler   = ancs_c_evt_handler;
        ancs_c_init.error_handler = apple_notification_error_handler;

        ret = ble_ancs_c_init(&m_ancs_c, &ancs_c_init);
        APP_ERROR_CHECK(ret);

        // Initialize NUS.
        memset(&nus_init, 0, sizeof(nus_init));

        nus_init.data_handler = nus_data_handler;

        ret = ble_nus_init(&m_nus, &nus_init);

        APP_ERROR_CHECK(ret);
}


/**@brief Function for initializing the advertising functionality.
 */
static void advertising_init(void)
{
        ret_code_t ret;
        ble_advertising_init_t init;

        memset(&init, 0, sizeof(init));

        static ble_uuid_t m_adv_uuids[1]; /**< Universally unique service identifiers. */

        m_adv_uuids[0].uuid = ANCS_UUID_SERVICE;
        m_adv_uuids[0].type = m_ancs_c.service.service.uuid.type;

        // init.advdata.name_type                = BLE_ADVDATA_FULL_NAME;
        // init.advdata.include_appearance       = true;
        init.srdata.name_type                = BLE_ADVDATA_FULL_NAME;
        init.srdata.include_appearance       = true;

        init.advdata.flags                    = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;
        init.advdata.uuids_complete.uuid_cnt  = 0;
        init.advdata.uuids_complete.p_uuids   = NULL;
        init.advdata.uuids_solicited.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
        init.advdata.uuids_solicited.p_uuids  = m_adv_uuids;


        init.config.ble_adv_whitelist_enabled = true;
        init.config.ble_adv_fast_enabled      = true;
        init.config.ble_adv_fast_interval     = APP_ADV_FAST_INTERVAL;
        init.config.ble_adv_fast_timeout      = APP_ADV_FAST_DURATION;
        init.config.ble_adv_slow_enabled      = true;
        init.config.ble_adv_slow_interval     = APP_ADV_SLOW_INTERVAL;
        init.config.ble_adv_slow_timeout      = APP_ADV_SLOW_DURATION;

        init.evt_handler = on_adv_evt;

        ret = ble_advertising_init(&m_advertising, &init);
        APP_ERROR_CHECK(ret);

        ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and LEDs.
 *
 * @param[out] p_erase_bonds  True if the clear bonds button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
        uint32_t ret;
        bsp_event_t startup_event;

        ret = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
        APP_ERROR_CHECK(ret);

        ret = bsp_btn_ble_init(NULL, &startup_event);
        APP_ERROR_CHECK(ret);

        *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the Event Scheduler.
 */
static void scheduler_init(void)
{
        APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}


/**@brief Function for initializing the database discovery module.
 */
static void db_discovery_init(void)
{
        ret_code_t ret = ble_db_discovery_init(db_disc_handler);
        APP_ERROR_CHECK(ret);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
        ret_code_t ret = NRF_LOG_INIT(NULL);
        APP_ERROR_CHECK(ret);

        NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
        ret_code_t err_code;
        err_code = nrf_pwr_mgmt_init();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
        app_sched_execute();
        if (NRF_LOG_PROCESS() == false)
        {
                nrf_pwr_mgmt_run();
        }
}

/**@brief Function for application main entry.
 */
int main(void)
{
        bool erase_bonds;

        /* enable instruction cache */
        NRF_NVMC->ICACHECNF = (NVMC_ICACHECNF_CACHEEN_Enabled << NVMC_ICACHECNF_CACHEEN_Pos) +
                              (NVMC_ICACHECNF_CACHEPROFEN_Disabled << NVMC_ICACHECNF_CACHEPROFEN_Pos);

        // Initialize.
        log_init();
        uart_init();
        timers_init();
        buttons_leds_init(&erase_bonds);
        scheduler_init();
        power_management_init();
        ble_stack_init();
        gap_params_init();
        gatt_init();
        db_discovery_init();
        services_init();
        advertising_init();
        conn_params_init();
        peer_manager_init();

        // Start execution.
        NRF_LOG_INFO("Apple Notification Center Service client example started.");
        advertising_start(erase_bonds);

        timers_start();

        // Enter main loop.
        for (;;)
        {
                idle_state_handle();
        }

}


/**
 * @}
 */
